#include <iostream>
using namespace std; 
int main() {
//   //Integer1. Дано расстояние L в сантиметрах.Используя операцию деления
     ////нацело, найти количество полных метров в нём(1 метр = 100см)
	 //int l, meters;
	 //cin >> l;
	 //meters = 1 / 100;
	 //cout << meters << endl;
	
	 ////Integer2. Дана масса M в килограммах.Используя операцию деления
	////нацело, найти количество полных тонн в ней(1 тонна = 1000 кг)
	////int m tons;
	////cin >> m;
	////tons = 1 / 1000;
	////cout << tons << endm;

	////Integer3◦ .Дан размер файла в байтах.Используя операцию деления нацело, 
	////найти количество полных килобайтов, которые занимает данный файл (1 килобайт = 1024 байта).
	////int bytes;
	//cin = b;
	//cout << bytes << endl;
	////int kbytes = bytes / 1024

	////Integer5◦. Даны целые положительные числа A и B (A > B). На отрезке длины A размещено максимально возможное количество отрезков длины B (безналожений).
 //   //Используя операцию взятия остатка от деления нацело, найти длину незанятой части отрезка A.
	///*int a, b;
	//cin >> a >> b;
	//int ost = a % b;
	//cout << ost << endl;*/

	////Integer6◦ .Дано двузначное число.Вывести вначале его левую цифру(десятки), а затем — его правую цифру(единицы).
	////Для нахождения десятков использовать операцию деления нацело, для нахождения единиц — операцию взятия остатка от деления
	//int num;
	//cin >> num;
	//int d = num / 10; // 52 / 10 = 5  98 / 10 = 9
	//int e = num % 10; // 52 % 10 = 2  98 % 10 = 8
	//cout << d << " " << e << endl;
	////100*e+10*d+s

 //   //Состав числа 10*d + e - > 10*e+d
	//
	////int sotni = num / 100;
	////int edinitsi = num % 10; 
	////123 % 100 -> 12       23 / 10;
	////123 / 10 - > 12               12 % 10 - > 2
	////int des = (num / 10) % 10;
	
	//Integer7◦. Дано двузначное число.Найти сумму и произведение его цифр.
	//int num;
	//cin >> num;
	//int d = 100 + 10 = 110 
	//int е = 100 * 10 = 1000
	//cout << d << endl;
	
	//Integer8◦. Дано двузначное число.Вывести число, полученное при перестановке цифр исходного числа.
	//cin >> a;
	//int d = a/10   
	//int е = a%10 
	//int b = 10 * e + d;
	//cout << d << endl;

}